app/controllers/schedule_controller.rb

SELECT "schedules".* FROM "schedules" WHERE "schedules"."user_id" = ?  [["user_id", "4"]]
---
  def viewAll
    @schedules = Schedule.where(user_id: current_user.id)

SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = ?  ORDER BY "schedules"."id" ASC LIMIT 1  [["id", 7]]
---
	def view
    @id = params[:id]
    @schedule = Schedule.where(id: @id).first

INSERT INTO "schedules" ("user_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", "4"], ["name", "Schedule1"], ["created_at", "2016-11-30 02:00:13.610949"], ["updated_at", "2016-11-30 02:00:13.610949"]]
---
  def create
    @schedule = Schedule.new
    @schedule.user_id = current_user.id
    @schedule.name = params[:schedule][:name]
    @schedule.save

SELECT "courses".* FROM "courses"
---
  def add
    @id = params[:id]
    @courses = Course.all

SELECT  "courses".* FROM "courses" WHERE "courses"."title" = ?  ORDER BY "courses"."id" ASC LIMIT 1  [["title", "CS 70 Discrete Math & Probability"]]
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = ?  ORDER BY "schedules"."id" ASC LIMIT 1  [["id", 8]]
UPDATE "schedules" SET "so2" = ?, "updated_at" = ? WHERE "schedules"."id" = ?
---
  def addCourse
    @title = params[:course][:title]
    @course = Course.where(title: @title).first
    @term = params[:course][:term]
    @id = params[:course][:id]
    @schedule = Schedule.where(id: @id).first
    if @term == "fr1"
      @schedule.fr1.push(@course)

SELECT  "courses".* FROM "courses" WHERE "courses"."title" = ?  ORDER BY "courses"."id" ASC LIMIT 1  [["title", "CS C8 Foundations of Data Science"]]
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = ?  ORDER BY "schedules"."id" ASC LIMIT 1  [["id", 2]]
UPDATE "schedules" SET "fr1" = ?, "updated_at" = ? WHERE "schedules"."id" = ?  [["fr1", nil], ["updated_at", "2016-11-30 04:28:59.604759"], ["id", 1]]
---
  def deleteCourse
    @title = params[:title]
    @id = params[:id]
    @course = Course.where(title: @title).first
    @schedule = Schedule.where(id: @id).first
    @schedule.fr1.delete(@course)
    @schedule.fr2.delete(@course)
    @schedule.so1.delete(@course)
    @schedule.so2.delete(@course)
    @schedule.ju1.delete(@course)
    @schedule.ju2.delete(@course)
    @schedule.se1.delete(@course)
    @schedule.se2.delete(@course)
    @schedule.save

DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 1]]
---
	def delete
	  	@schedule = Schedule.where(id: params[:id])
	  	@schedule.delete_all