app/controllers/schedule_controller.rb

  	def view
  		@course = Course.where(:user_id => current_user)
---
SELECT "courses".* FROM "courses" WHERE "courses"."user_id" IS NULL

	def add
	  	@course = Course.where(id: params[:id])
	  	@course.update_all(:user_id => current_user)
---
UPDATE "courses" SET "user_id" = NULL WHERE "courses"."id" = ?  [["id", 6]]